{
    "name": "C4_1",
    "probTex": "Let $X$ be a complex torus. Prove that there exists a two-sheeted cover $f:X\\to S^2$ with four branch points.",
    "solnTex": "First, note that any nonconstant map into $S^2$ is a branched cover. This is a result of the fact that the degree of a holomorphic function on compact Riemann surfaces is constant. Moreover, a nonconstant map into $S^2$ is the same thing as a nonconstant meromorphic function. Then we are looking for a meromorphic function with degree 2. The way we will measure the degree is by looking at the poles; we are looking for a meromorphic function $f:X\\to S^2$ with two poles (counting multiplicities). We will use the Riemann Roch theorem to obtain such a function, then the Riemann Hurwitz formula to show the result we want.\\nLet $p,q$ be distinct points in $X$. Apply the Riemann Roch theorem to the divisor $D=p+q$ to get \\n\\[l(D)-l(K-D)=deg(D)-g+1\\]\\n The degree of $D$ is $2$ and the genus is $1$, so $l(D)\\geq2$. That means there are two linearly independent meromorphic functions $f_1,f_2$ on $X$ with at worst simple poles at $p$ or $q$. Neither function can have only one pole of order 1 because a meromorphic function of degree 1 is a biholomorphism to $S^2$, and $X\\not\\cong S^2$. Thus $f_1,f_2$ have either no poles or two poles. A meromorphic function with no poles is constant, and any two constant functions are linearly dependent, so one of them has poles. Then the one with poles has two poles, so we have found a meromorphic function with two poles. \\n\\[\\]\\n Now apply the Riemann Hurwitz formula to the function $f$ with two poles. \\n\\[2-2g_X=d(2-2g_{S^2})-R_f\\]\\n \\n\\[0=4-R_f\\]\\n Thus $R_f=4$. Recall the ramification index is the sum over all points in $X$ of $(p-1)$ where $f$ is given as $z^p$ in particular coordinates centered at $x$ (local mapping theorem). The degree of $f$ is $2$, so the highest $p$ can possibly be is $2$. That means the ramification index must come from four distinct points, each of which is a two-fold branch. Thus $f$ is a two-sheeted cover with four branch points.",
    "completeness": "full",
    "topics": [
        "Degree",
        "RiemannSurfaces",
        "RiemannRoch",
        "Meromorphic",
        "HurwitzFormula"
    ],
    "viability": "good"
}